# RemoveMainSubelementsFromCustomConnection Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandlerType..::..RemoveMainSubelementsFromCustomConnection Method
StructuralConnectionHandlerType Class See Also
---
Removes one or more subelements from a StructuralConnectionHandlerType. The subelements will be erased.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static void RemoveMainSubelementsFromCustomConnection(
	StructuralConnectionHandler structuralConnectionHandler,
	IList<Subelement> subelements
)
```

Visual Basic
---
```text
Public Shared Sub RemoveMainSubelementsFromCustomConnection ( _
	structuralConnectionHandler As StructuralConnectionHandler, _
	subelements As IList(Of Subelement) _
)
```

Visual C++
---
```text
public:
static void RemoveMainSubelementsFromCustomConnection(
	StructuralConnectionHandler^ structuralConnectionHandler,
	IList<Subelement^>^ subelements
)
```

# ### Parameters
structuralConnectionHandler
    Type: Autodesk.Revit.DB.Structure..::..StructuralConnectionHandler The existing StructuralConnectionHandler having custom StructuralConnectionHandlerType which is about to be modified.
subelements
    Type: System.Collections.Generic..::..IList<(Of <(<'Subelement>)>)> The main Subelements of input StructuralConnectionHandler which are to be used to modify custom StructuralConnectionHandlerType.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Input StructuralConnectionHandler must have custom type. -or- All the input Subelements must belong to input StructuralConnectionHandler. After modification of StructuralConnectionHandlerType there must remain at least one subelement of structural connections category in StructuralConnectionHandler. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace